"""
เครื่องคำนวณค่าไฟฟ้าแบบขึ้นบันได
เขียนโปรแกรมคำนวณค่าไฟฟ้าจากจำนวนหน่วยไฟฟ้าที่ใช้ในเดือนนั้น โดยใช้ฟังก์ชั่น
calculate_eletriciy_cost(units)

ค่าไฟฟ้าขึ้นกับปริมาณการใช้งาน
จำนวนหน่วยที่ใข้          อัตราต่อหน่วย
1-50 หน่วยแรก          2.50 บาท
51-100 หน่วย           3.00 บาท
101-200 หน่วย          3.50 บาท
มากกว่า 200 หน่วย       4.00 บาท

ให้คิดค่าบริการคงที่เพิ่มอีก 25 บาทต่อเดือน

เงื่อนไข
 โปรแกรมแสดงเมนูวนซ้ำ
 ผู้ใช้เลือก 1 เพื่อคำนวณค่าไฟ
 ผู้ใช้เลือก 2 เพื่อออกจากโปรแกรม
 หากเลือกเมนูอื่น
 ให้แจ้งว่าเลือกเมนูไม่ถูกต้อง
 จำนวนหน่วยไฟฟ้าต้องไม่ติดลบ
 ให้แสดงรายละเอียดค่าไฟแต่ละช่วและยอดรวมสุทธิ

 ตัวอย่างหน้าจอ:
 === โปรแกรมคำนวณค่าไฟฟ้า ====
 1.คำนวณค่าไฟ
 2. ออกจากโปรแกรม

 กรอกจำนวนหน่วยไฟฟ้า  : 120

 รายละเอียดค่าไฟ:
 1-50 หน่วย: 125.00 บาท
 51-100 หน่วย: 150.00 บาท
 101-120 หน่วย: 70.00 บาท
 ค่าบริการ: 25.00 บาท
 รวมค่าไฟทั้งสิ้น: 370.00 บาท
"""

print("=== โปรแกรมคำนวณค่าไฟฟ้า ====")

while True:
    print("1.คำนวณค่าไฟ")
    print("2. ออกจากโปรแกรม")
    choice = input("เลือกเมนู: ").strip()

    if choice == "1":
        units = int(input("\nกรอกจำนวนหน่วยไฟฟ้า  : "))

        if units < 0:
            print("จำนวนหน่วยไฟฟ้าต้องไม่ติดลบ\n")

        else:
            print("\nรายละเอียดค่าไฟ:")

            if units > 200:
                cost = (2.50 * 50) + (3.00 * 50) + (3.50 * 100) + (4.00 * (units - 200)) + 25
                print("1-50 หน่วย: 125.00 บาท")
                print("51-100 หน่วย: 150.00 บาท")
                print("101-200 หน่วย: 350.00 บาท")
                print(f"201-{units} หน่วย: {4.00 * (units - 200):.2f} บาท")

            elif units > 100:
                cost = (2.50 * 50) + (3.00 * 50) + (3.50 * (units - 100)) + 25
                print("1-50 หน่วย: 125.00 บาท")
                print("51-100 หน่วย: 150.00 บาท")
                print(f"101-{units} หน่วย: {3.50 * (units - 100):.2f} บาท")

            elif units > 50:
                cost = (2.50 * 50) + (3.00 * (units - 50)) + 25
                print("1-50 หน่วย: 125.00 บาท")
                print(f"51-{units} หน่วย: {3.00 * (units - 50):.2f} บาท")

            elif units > 0:
                cost = (2.50 * units) + 25
                print(f"1-{units} หน่วย: {2.50 * units:.2f} บาท")

            else:
                cost = 25

            print("ค่าบริการ: 25.00 บาท")
            print(f"รวมค่าไฟทั้งสิ้น: {cost:.2f} บาท\n")

    elif choice == "2":
        print("ออกจากโปรแกรม")
        break

    else:
        print("เลือกเมนูไม่ถูกต้อง\n")
